Revit 2027 API
BuiltInFailures.RebarFailures.MissingCurrentConstraintForHandle Property
 The current handle has no constraint. Please select a valid target to apply a new constraint.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MissingCurrentConstraintForHandle { get; }
Public Shared ReadOnly Property MissingCurrentConstraintForHandle As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MissingCurrentConstraintForHandle {
	FailureDefinitionId^ get ();
}
static member MissingCurrentConstraintForHandle : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace